cask_args appdir: "/Applications"

# Taps
# ----------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "moncho/dry"
tap "neovim/neovim"
tap "phrase/brewed"

# Packages
# ----------------------------------------------------------------------------
brew "ack"
brew "bat"
brew "ctags"
brew "dry"
brew "efm-langserver"
brew "fff"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "goenv", args: ['HEAD']
brew "gource"
brew "grc"
brew "htop"
brew "httpie"
brew "jenv"
brew "jq"
brew "lua-language-server"
brew "neovim"
brew "nmap"
brew "nodenv"
brew "phraseapp"
brew "pyenv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "shellcheck"
brew "tfenv"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-syntax-highlighting"

# Fonts
# ----------------------------------------------------------------------------

# Monospace
cask "font-fira-code"
cask "font-hack"

# Applications
# ----------------------------------------------------------------------------

cask "1password"
cask "alacritty"
cask "calibre"
cask "daisydisk"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "moom"
cask "slack"
cask "spotify"
cask "transmit"
cask "typora"
cask "vlc"
