cask_args appdir: "/Applications"

# Taps
# ----------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "moncho/dry"
tap "neovim/neovim"
tap "phrase/brewed"
tap "hashicorp/tap"

# Packages
# ----------------------------------------------------------------------------
brew "ack"
brew "bat"
brew "colima"
brew "ctags"
brew "docker"
brew "dry"
brew "efm-langserver"
brew "fff"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-sed"
brew "goenv", args: ["HEAD"]
brew "gource"
brew "grc"
brew "htop"
brew "httpie"
brew "jenv"
brew "jq"
brew "lua-language-server"
brew "neovim"
brew "nmap"
brew "nodenv"
brew "phraseapp"
brew "pure"
brew "pyenv"
brew "rbenv"
brew "rg"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "shellcheck"
brew "stylua"
brew "terraform-ls"
brew "tfenv"
brew "tmate"
brew "tmux"
brew "tree"
brew "uncrustify"
brew "wget"
brew "yaml-language-server"
brew "yamllint"
brew "zsh"
brew "zsh-syntax-highlighting"

# Fonts
# ----------------------------------------------------------------------------
# Monospace
cask "font-anka-coder"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-monocraft"

# Applications
# ----------------------------------------------------------------------------
cask "1password"
cask "calibre"
cask "daisydisk"
cask "google-chrome"
cask "google-cloud-sdk"
cask "kitty"
cask "macdown"
cask "moom"
cask "paw"
cask "proxyman"
cask "rocket"
cask "slack"
cask "spotify"
cask "transmit"
cask "vlc"
