# Taps
# ----------------------------------------------------------------------------
tap "neovim/neovim"

# Packages
# ----------------------------------------------------------------------------
brew "difftastic"
brew "fff"
brew "fzf"
brew "gh"
brew "git-delta"
brew "goenv", args: ["HEAD"]
brew "nodenv"
brew "openconnect"
brew "pyenv"
brew "rbenv"
brew "rg"
brew "ruby-build"
brew "tfenv"
brew "zellij"
brew "zsh"
brew "zsh-syntax-highlighting"

# Fonts
# ----------------------------------------------------------------------------
# Monospace
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# Applications
# ----------------------------------------------------------------------------
cask "1password"
cask "kitty"
